README.md
```mermaid
classDiagram

class City {
    float x
    float y
    distance(City) float
}

class Map {
    distance(from, to) float
}

Map o-- City

class Order {
    City city
    float wait_time
    float time_limit
}

Order --> City

class OrderList {
    random_route() Route
}

OrderList o-- Order
OrderList ..> Route

class TimeOnWay {
    Map map
    float speed
}

TimeOnWay --> Map

class Route {
    Map map
    TimeOnWay time_on_way
    City origin
    float delay
}

Route --> TimeOnWay

class Item {
    Route route
    float fitness
    list~Order~ dna
}

Item --> Route
Item --> Order

class Population {
    list~Item~ items
    list~float~ fitness
    generate(size)
}

Population o-- Item

class Genetic {
    Population population
    float cross_rate
    float mutate_rate
    evolve(max_iter, max_unchanged_iter)
}

Genetic --> Population
```
